---
kind: method
id: M:Autodesk.Revit.DB.IExportContext.OnPolymesh(Autodesk.Revit.DB.PolymeshTopology)
source: html/6a060c37-3225-217e-b150-2eaea3a22c29.htm
---
# Autodesk.Revit.DB.IExportContext.OnPolymesh Method

This method is called when a tessellated polymesh of a 3d face is being output.

## Syntax (C#)
```csharp
void OnPolymesh(
	PolymeshTopology node
)
```

## Parameters
- **node** (`Autodesk.Revit.DB.PolymeshTopology`) - A node representing topology of the polymesh